In [1]:
import pandas as pd
from spm.accessors.config_accessors.employee_accessor import (
    EmployeeAccessor
)

In [2]:
data=EmployeeAccessor(2).get_active_employee_status_and_kd_for_client()

In [3]:
df = pd.DataFrame(data)

In [4]:
df['knowledge_begin_date'] = pd.to_datetime(df['knowledge_begin_date'])

In [5]:
df['year'] = df['knowledge_begin_date'].dt.year
df['month'] = df['knowledge_begin_date'].dt.month

In [6]:
df

              knowledge_begin_date  status  year  month
0 2021-11-25 09:14:44.479251+00:00   Added  2021     11
1 2022-02-24 07:08:23.360342+00:00   Added  2022      2
2 2022-03-22 18:05:39.841862+00:00  Active  2022      3
3 2022-03-23 10:52:28.364452+00:00   Added  2022      3
4 2022-03-23 11:10:11.199637+00:00   Added  2022      3
5 2022-03-25 11:52:14.925071+00:00   Added  2022      3

In [7]:
grp = df.groupby(['year', 'month']).status.value_counts()
grp

year  month  status
2021  11     Added     1
2022  2      Added     1
      3      Added     3
             Active    1
Name: status, dtype: int64

In [168]:
grp.to_dict()

{(2021, 11, 'Added'): 1,
 (2022, 2, 'Added'): 1,
 (2022, 3, 'Added'): 3,
 (2022, 3, 'Active'): 1}

In [115]:
df = pd.DataFrame({'A': 'a a b'.split(), 'B': [1,2,3], 'C': [4,6, 5]})
df

   A  B  C
0  a  1  4
1  a  2  6
2  b  3  5

In [133]:
g = df.groupby('A')
g.first()

g.apply(lambda x: x / x.sum())

          B    C
0  0.333333  0.4
1  0.666667  0.6
2  1.000000  1.0

In [ ]:
s